; domain
; LO QUE DIJERON EN CLASE
; para contar lo que debemos hacer es crear predicados que sean
;      n0, n1, n2, ..., nk y poner a true sólo el numero que llevamos
; cuidado al enganchar, no se pueden desenganchar vagones con paquetes
; no se puede enganchar un vagón al medio
; No hace falta desenganchar un vagón para dejar un paquete
; No se puede dejar un paquete sospechoso
; El método para inspeccionar da igual (dejar paquete, vagón o tren entero) pero debemos dejarlo explicado
; ESTÁ PROHIBIDO USAR PRECONDICIONES NEGATIVAS PORQUE EL PLANIFICADOR OPTIC NO LAS SOPORTA

(define (domain aeropuerto)
    (:requirements :strips :typing)
    (:types
      ubicacion
      maquina
      vagon
      equipaje
      nivel
    )

     (:predicates
    ; Grafo de la terminal
    (siguiente ?desde - ubicacion ?hasta - ubicacion) ; Se puede ir desde, hasta según el mapa

    ; Global
    (esta-en ?m - (either maquina equipaje vagon) ?u - ubicacion)   ; la máquina m está en la ubicación u
    
    ; Vehículos
    (enganchado ?v - vagon ?m - (either maquina vagon)) ; el vagón v está enganchado a la máquina m
    (vagon-suelto ?v - vagon)                  ; v está suelto (no enganchado a ninguna máquina)
    (libre ?m - (either maquina vagon))

    ; Equipajes
    (equipaje-en-vagon ?e - equipaje ?v - vagon)    ; e está dentro del vagón v

    ; Contador de capacidad del vagón (capacidad = 2)
    (en-nivel ?v - vagon ?n - nivel)                ; el vagón v esta en el nivel n
    (siguiente-nivel ?n1 - nivel ?n2 - nivel)
    (nivel-cero ?n - nivel)

    ; Tipo de equipaje
    (normal ?e - equipaje)
    (sospechoso ?e - equipaje)

    ; Marcar oficina de inspección
    (es-oficina-inspeccion ?u - ubicacion)
  )

  ; Mover la máquina por el grafo

  (:action mover-maquina
    :parameters (?m - maquina ?desde ?hasta - ubicacion)
    :precondition (and
      (esta-en ?m ?desde)
      (siguiente ?desde ?hasta)
    )
    :effect (and
      (esta-en ?m ?hasta)
      (not (esta-en ?m ?desde))
    )
  )

  ;   Enganchar / desenganchar vagones 

  (:action enganchar-vagon
    :parameters (?v - vagon ?m - (either maquina vagon) ?u - ubicacion ?n - nivel)
    :precondition (and
      (vagon-suelto ?v)
      (nivel-cero ?n)
      (esta-en ?v ?u)
      (esta-en ?m ?u)
      (libre ?m)
    )
    :effect (and
      (enganchado ?v ?m)
      (not (vagon-suelto ?v))
      (not (esta-en ?v ?u))
      (not (libre ?m))
      (libre ?v)
    )
  )

  (:action desenganchar-vagon
    :parameters (?v - vagon ?m - (either maquina vagon) ?u - ubicacion ?n - nivel)
    :precondition (and
      (enganchado ?v ?m)
      (en-nivel ?v ?n)
      (nivel-cero ?n)
      (esta-en ?m ?u)
    )
    :effect (and
      (vagon-suelto ?v)
      (not (libre ?v))
      (esta-en ?v ?u)
      (not (enganchado ?v ?m))
      (libre ?m)
    )
  )

  ;   Cargar equipajes en vagones
  ; El vagón debe estar enganchado a la máquina en la misma ubicación.

  (:action cargar-equipaje
    :parameters (?e - equipaje ?v - vagon ?m - maquina ?u - ubicacion ?n1 ?n2 - nivel)
    :precondition (and
      (esta-en ?m ?u)
      (enganchado ?v ?m)
      (esta-en ?e ?u)
      (en-nivel ?v ?n1)
      (siguiente-nivel ?n1 ?n2)
    )
    :effect (and
      (equipaje-en-vagon ?e ?v)
      (not (esta-en ?e ?u))
      (en-nivel ?v ?n2)
      (not (en-nivel ?v ?n1))
    )
  )


  ;   Descargar equipajes normales

  ; No hace falta desenganchar el vagón.
  ; Se descarga donde esté la máquina.

  (:action descargar-normal
    :parameters (?e - equipaje ?v - vagon ?m - maquina ?u - ubicacion ?n1 ?n2 - nivel)
    :precondition (and
      (normal ?e)
      (equipaje-en-vagon ?e ?v)
      (enganchado ?v ?m)
      (esta-en ?m ?u)
      (en-nivel ?v ?n1)
      (siguiente-nivel ?n2 ?n1)
    )
    :effect (and
      (esta-en ?e ?u)
      (not (equipaje-en-vagon ?e ?v))
      (en-nivel ?v ?n2)
      (not (en-nivel ?v ?n1))
    )
  )

  ;   Inspeccionar Equipajes
  
  ; Una vez en la oficina de inspección, el equipaje deja de ser sospechoso

  (:action inspeccionar-equipaje
    :parameters (?e - equipaje ?u - ubicacion ?v - vagon ?m - maquina)
    :precondition (and
      (sospechoso ?e)
      (equipaje-en-vagon ?e ?v)
      (enganchado ?v ?m)
      (esta-en ?m ?u)
      (es-oficina-inspeccion ?u)
    )
    :effect (and
      (normal ?e)
      (not (sospechoso ?e))
    )
  )

)

; problem
(define (problem aeropuerto-p1)
  (:domain aeropuerto)

  (:objects
    ; ubicaciones
    facturacion recogida inspeccion
    puerta1 puerta2 puerta3 puerta4
    puerta5 puerta6 puerta7 puerta8 - ubicacion

    ; maquinas
    m1 m2 - maquina

    ; vagones
    v1 v2 v3 v4 v5 - vagon

    ; equipajes
    e1 e2 e3 e4 e5 e6 - equipaje

    ; niveles de carga
    n0 n1 n2 - nivel   
  )

  (:init
    ; ---------- Estructura de la terminal ----------
    ; zona común
    (siguiente facturacion recogida)
    (siguiente recogida facturacion)

    (siguiente facturacion inspeccion)
    (siguiente inspeccion facturacion)

    (siguiente recogida inspeccion)
    (siguiente inspeccion recogida)

    ; conexiones con puertas
    (siguiente facturacion puerta2)
    (siguiente puerta2 facturacion)

    (siguiente recogida puerta6)
    (siguiente puerta6 recogida)

    (siguiente inspeccion puerta1)
    (siguiente puerta1 inspeccion)

    (siguiente inspeccion puerta5)
    (siguiente puerta5 inspeccion)

    ; pasillo izquierdo: puertas contiguas 2–4–3–1
    (siguiente puerta2 puerta4)
    (siguiente puerta4 puerta2)

    (siguiente puerta4 puerta3)
    (siguiente puerta3 puerta4)

    (siguiente puerta3 puerta1)
    (siguiente puerta1 puerta3)

    ; pasillo derecho: puertas contiguas 6–8–7–5
    (siguiente puerta6 puerta8)
    (siguiente puerta8 puerta6)

    (siguiente puerta8 puerta7)
    (siguiente puerta7 puerta8)

    (siguiente puerta7 puerta5)
    (siguiente puerta5 puerta7)

    ; Oficina de inspección
    (es-oficina-inspeccion inspeccion)


    ; Niveles
    (siguiente-nivel n0 n1)
    (siguiente-nivel n1 n2)
    (nivel-cero n0)

    ; ---------- Vehículos ----------
    ; tres vagones sueltos en puerta1
    (esta-en v1 puerta1)
    (esta-en v2 puerta1)
    (esta-en v3 puerta1)

    ; dos vagones sueltos en puerta5
    (esta-en v4 puerta5)
    (esta-en v5 puerta5)

    ; todos los vagones empiezan libres y vacíos (n0)
    (vagon-suelto v1)
    (vagon-suelto v2)
    (vagon-suelto v3)
    (vagon-suelto v4)
    (vagon-suelto v5)

    (en-nivel v1 n0)
    (en-nivel v2 n0)
    (en-nivel v3 n0)
    (en-nivel v4 n0)
    (en-nivel v5 n0)


    (libre m1)
    (libre m2)

    (not (libre v1))
    (not (libre v2))
    (not (libre v3))
    (not (libre v4))
    (not (libre v5))

    ; dos máquinas en la zona de recogida
    (esta-en m1 recogida)
    (esta-en m2 recogida)

    ; ---------- Equipajes ----------
    ; 1) no sospechoso facturado → puerta4
    (esta-en e1 facturacion)
    (normal e1)

    ; 2) no sospechoso facturado → puerta8
    (esta-en e2 facturacion)
    (normal e2)

    ; 3) sospechoso llega a puerta6 → recogida (pasando por inspección)
    (esta-en e3 puerta6)
    (sospechoso e3)

    ; 4) no sospechoso llega a puerta6 → recogida
    (esta-en e4 puerta6)
    (normal e4)

    ; 5) no sospechoso llega a puerta2 → recogida
    (esta-en e5 puerta2)
    (normal e5)

    ; 6) sospechoso llega a puerta2 → recogida (pasando por inspección)
    (esta-en e6 puerta2)
    (sospechoso e6)
    )

  (:goal
    (and
      ; destinos finales
      (esta-en e1 puerta4)
      (esta-en e2 puerta8)
      (esta-en e3 recogida)
      (esta-en e4 recogida)
      (esta-en e5 recogida)
      (esta-en e6 recogida)
    )
  )
)

; plan
1. (mover-maquina m2 recogida inspeccion)
   deleted: (esta-en m2 recogida)
   added: (esta-en m2 inspeccion)
   goals met: 0 of 6
2. (mover-maquina m2 inspeccion puerta1)
   deleted: (esta-en m2 inspeccion)
   added: (esta-en m2 puerta1)
   goals met: 0 of 6
3. (enganchar-vagon v3 m2 puerta1 n0)
   deleted: (vagon-suelto v3) (esta-en v3 puerta1) (libre m2)
   added: (enganchado v3 m2) (libre v3)
   goals met: 0 of 6
4. (mover-maquina m2 puerta1 inspeccion)
   deleted: (esta-en m2 puerta1)
   added: (esta-en m2 inspeccion)
   goals met: 0 of 6
5. (mover-maquina m2 inspeccion facturacion)
   deleted: (esta-en m2 inspeccion)
   added: (esta-en m2 facturacion)
   goals met: 0 of 6
6. (mover-maquina m2 facturacion puerta2)
   deleted: (esta-en m2 facturacion)
   added: (esta-en m2 puerta2)
   goals met: 0 of 6
7. (cargar-equipaje e6 v3 m2 puerta2 n0 n1)
   deleted: (esta-en e6 puerta2) (en-nivel v3 n0)
   added: (equipaje-en-vagon e6 v3) (en-nivel v3 n1)
   goals met: 0 of 6
8. (cargar-equipaje e5 v3 m2 puerta2 n1 n2)
   deleted: (esta-en e5 puerta2) (en-nivel v3 n1)
   added: (equipaje-en-vagon e5 v3) (en-nivel v3 n2)
   goals met: 0 of 6
9. (mover-maquina m2 puerta2 facturacion)
   deleted: (esta-en m2 puerta2)
   added: (esta-en m2 facturacion)
   goals met: 0 of 6
10. (mover-maquina m2 facturacion recogida)
   deleted: (esta-en m2 facturacion)
   added: (esta-en m2 recogida)
   goals met: 0 of 6
11. (descargar-normal e5 v3 m2 recogida n2 n1)
   deleted: (equipaje-en-vagon e5 v3) (en-nivel v3 n2)
   added: (esta-en e5 recogida) (en-nivel v3 n1)
   goals met: 1 of 6
12. (mover-maquina m2 recogida inspeccion)
   deleted: (esta-en m2 recogida)
   added: (esta-en m2 inspeccion)
   goals met: 1 of 6
13. (inspeccionar-equipaje e6 inspeccion v3 m2)
   deleted: (sospechoso e6)
   added: (normal e6)
   goals met: 1 of 6
14. (mover-maquina m2 inspeccion facturacion)
   deleted: (esta-en m2 inspeccion)
   added: (esta-en m2 facturacion)
   goals met: 1 of 6
15. (cargar-equipaje e2 v3 m2 facturacion n1 n2)
   deleted: (esta-en e2 facturacion) (en-nivel v3 n1)
   added: (equipaje-en-vagon e2 v3) (en-nivel v3 n2)
   goals met: 1 of 6
16. (mover-maquina m2 facturacion recogida)
   deleted: (esta-en m2 facturacion)
   added: (esta-en m2 recogida)
   goals met: 1 of 6
17. (descargar-normal e6 v3 m2 recogida n2 n1)
   deleted: (equipaje-en-vagon e6 v3) (en-nivel v3 n2)
   added: (esta-en e6 recogida) (en-nivel v3 n1)
   goals met: 2 of 6
18. (mover-maquina m2 recogida puerta6)
   deleted: (esta-en m2 recogida)
   added: (esta-en m2 puerta6)
   goals met: 2 of 6
19. (mover-maquina m2 puerta6 puerta8)
   deleted: (esta-en m2 puerta6)
   added: (esta-en m2 puerta8)
   goals met: 2 of 6
20. (descargar-normal e2 v3 m2 puerta8 n1 n0)
   deleted: (equipaje-en-vagon e2 v3) (en-nivel v3 n1)
   added: (esta-en e2 puerta8) (en-nivel v3 n0)
   goals met: 3 of 6
21. (mover-maquina m2 puerta8 puerta6)
   deleted: (esta-en m2 puerta8)
   added: (esta-en m2 puerta6)
   goals met: 3 of 6
22. (cargar-equipaje e4 v3 m2 puerta6 n0 n1)
   deleted: (esta-en e4 puerta6) (en-nivel v3 n0)
   added: (equipaje-en-vagon e4 v3) (en-nivel v3 n1)
   goals met: 3 of 6
23. (cargar-equipaje e3 v3 m2 puerta6 n1 n2)
   deleted: (esta-en e3 puerta6) (en-nivel v3 n1)
   added: (equipaje-en-vagon e3 v3) (en-nivel v3 n2)
   goals met: 3 of 6
24. (mover-maquina m2 puerta6 recogida)
   deleted: (esta-en m2 puerta6)
   added: (esta-en m2 recogida)
   goals met: 3 of 6
25. (descargar-normal e4 v3 m2 recogida n2 n1)
   deleted: (equipaje-en-vagon e4 v3) (en-nivel v3 n2)
   added: (esta-en e4 recogida) (en-nivel v3 n1)
   goals met: 4 of 6
26. (mover-maquina m2 recogida inspeccion)
   deleted: (esta-en m2 recogida)
   added: (esta-en m2 inspeccion)
   goals met: 4 of 6
27. (inspeccionar-equipaje e3 inspeccion v3 m2)
   deleted: (sospechoso e3)
   added: (normal e3)
   goals met: 4 of 6
28. (mover-maquina m2 inspeccion recogida)
   deleted: (esta-en m2 inspeccion)
   added: (esta-en m2 recogida)
   goals met: 4 of 6
29. (descargar-normal e3 v3 m2 recogida n1 n0)
   deleted: (equipaje-en-vagon e3 v3) (en-nivel v3 n1)
   added: (esta-en e3 recogida) (en-nivel v3 n0)
   goals met: 5 of 6
30. (mover-maquina m2 recogida facturacion)
   deleted: (esta-en m2 recogida)
   added: (esta-en m2 facturacion)
   goals met: 5 of 6
31. (cargar-equipaje e1 v3 m2 facturacion n0 n1)
   deleted: (esta-en e1 facturacion) (en-nivel v3 n0)
   added: (equipaje-en-vagon e1 v3) (en-nivel v3 n1)
   goals met: 5 of 6
32. (mover-maquina m2 facturacion puerta2)
   deleted: (esta-en m2 facturacion)
   added: (esta-en m2 puerta2)
   goals met: 5 of 6
33. (mover-maquina m2 puerta2 puerta4)
   deleted: (esta-en m2 puerta2)
   added: (esta-en m2 puerta4)
   goals met: 5 of 6
34. (descargar-normal e1 v3 m2 puerta4 n1 n0)
   deleted: (equipaje-en-vagon e1 v3) (en-nivel v3 n1)
   added: (esta-en e1 puerta4) (en-nivel v3 n0)
   goals met: 6 of 6
